In [24]:
import pandas as pd
import sqlalchemy as db

connection_str = f'mysql+pymysql://root:admin@172.17.0.2:3306/imdb'
engine = db.create_engine(connection_str)
conn = engine.connect()

import plotly.express as px
import plotly.io as pio

pio.renderers.default = 'browser'

from tqdm import tqdm

In [3]:
with open('most_successful_250.txt', 'r') as f:
    most_successful_250_tconsts = f.read().split('\n')

In [4]:
query = '''
    SELECT * FROM title_principals
    WHERE category = 'actor' OR category = 'actress'
'''
df = pd.read_sql(query, conn)

In [5]:
to_delete = []
for index, row in tqdm(df.iterrows()):
    if row['tconst'] not in most_successful_250_tconsts:
        to_delete.append(index)
df = df.drop(labels=to_delete, axis=0)

20500187it [46:02, 7421.84it/s]

In [7]:
df.to_csv('actors_250.tsv', sep='\t')

In [15]:
actors_gb = df.groupby('nconst').count().sort_values('tconst', ascending=False)
actors_gb

           tconst  ordering  category  job  characters
nconst
nm1469236       4         4         4    0           4
nm0048389       4         4         4    0           4
nm1102891       4         4         4    0           4
nm0855039       4         4         4    0           4
nm0666739       3         3         3    0           3
...           ...       ...       ...  ...         ...
nm0557733       1         1         1    0           1
nm0556165       1         1         1    0           1
nm0555094       1         1         1    0           1
nm0553468       1         1         1    0           1
nm9937520       1         1         1    0           1

[1899 rows x 5 columns]

In [22]:
actors_count_df = pd.DataFrame(actors_gb).reset_index()
actors_count_df.drop(labels=['ordering', 'category', 'job', 'characters'], axis=1, inplace=True)
actors_count_df = actors_count_df.rename(columns={'tconst': 'count'})
actors_count_df

         nconst  count
0     nm1469236      4
1     nm0048389      4
2     nm1102891      4
3     nm0855039      4
4     nm0666739      3
...         ...    ...
1894  nm0557733      1
1895  nm0556165      1
1896  nm0555094      1
1897  nm0553468      1
1898  nm9937520      1

[1899 rows x 2 columns]

In [25]:
names_df = pd.read_sql('SELECT nconst, primaryName FROM name_basics', conn)

In [30]:
for i in tqdm(range(100)):
    nconst = actors_count_df.iloc[i]['nconst']
    primaryName = names_df[names_df['nconst'] == nconst].iloc[0]['primaryName']
    actors_count_df.at[i, 'name'] = primaryName

100%|██████████| 100/100 [01:29<00:00,  1.12it/s]

In [35]:
actors_count_df.head()

      nconst  count               name
0  nm1469236      4      Olivia Colman
1  nm0048389      4  Dee Bradley Baker
2  nm1102891      4     Kristen Schaal
3  nm0855039      4      David Tennant
4  nm0666739      3         Aaron Paul

In [34]:
actors_count_df.to_csv('../treated_datasets/actors_count.tsv', sep='\t')